Revit 2027 API
SchemaCommon.Hidden Property
 The property labeled "Hidden" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string Hidden { get; }
Public Shared ReadOnly Property Hidden As String
	Get
public:
static property String^ Hidden {
	String^ get ();
}
static member Hidden : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace